; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-6)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 )
(:init
(on b1 b4)
(on b2 b6)
(ontable b3)
(ontable b4)
(on b5 b2)
(ontable b6)
(clear b1)
(clear b3)
(clear b5)
)
(:goal
(and
(on b2 b1)
(on b3 b4)
(on b4 b2)
(on b6 b3))
)
)

; plan
1. (move-b-to-t b5 b2)
   deleted: (on b5 b2)
   added: (ontable b5) (clear b2)
   goals met: 0 of 4
2. (move-b-to-b b1 b4 b5)
   deleted: (clear b5) (on b1 b4)
   added: (on b1 b5) (clear b4)
   goals met: 0 of 4
3. (move-b-to-b b2 b6 b1)
   deleted: (clear b1) (on b2 b6)
   added: (on b2 b1) (clear b6)
   goals met: 1 of 4
4. (move-t-to-b b4 b2)
   deleted: (clear b2) (ontable b4)
   added: (on b4 b2)
   goals met: 2 of 4
5. (move-t-to-b b3 b4)
   deleted: (clear b4) (ontable b3)
   added: (on b3 b4)
   goals met: 3 of 4
6. (move-t-to-b b6 b3)
   deleted: (clear b3) (ontable b6)
   added: (on b6 b3)
   goals met: 4 of 4
